# 1.  Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# o  [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

list = [2, 3, 5, 9, 3]
sum = 0
for i in range(len(list)):
    if i%2 != 0:
        sum += list[i]
print(sum)

# 2.  Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# o  [2, 3, 4, 5, 6] => [12, 15, 16];

list1 = [2, 3, 4, 2, 6, 7,8]
result = []
for i in range((len(list1)+1)//2):
    result.append(list1[i]*list1[-1-i])
print(result)

# 3.Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# Пример:
# o  [1.1, 1.2, 3.1, 5, 10.01] => 0.19
list = [1.1, 1.2, 3.1, 5, 10.01] 
list_frac = [i - int(i) for i in list if int(i) != i]
result = max(list_frac)- min(list_frac)
print(round(result, 2))

# 4.  Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
#   45 -> 101101
#   3 -> 11
#   2 -> 10
x = 45
res = ''
while x > 0:
    res = str(x%2)+res
    x//=2
print(res)

# 5.  Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
n = int(input('Введите число: '))

def get_fibonacci(n):
    fibo_nums = []
    a, b = 1, 1
    for i in range(n-1):
        fibo_nums.append(a)
        a, b = b, a + b
    a, b = 0, 1
    for i in range (n):
        fibo_nums.insert(0, a)
        a, b = b, a - b
    return fibo_nums

fibo_nums = get_fibonacci(n)
print(get_fibonacci(n))
print(fibo_nums.index(0))